This is something deeper, either in terraform or the azurerm provider as I have another instance of it. Again this is in a module. Basically my code calls a module, part of that it passes the resource group to the module. eg

```
module "storage" {
  depends_on = [
    azurerm_resource_group.main
  ]
  providers = {
    azurerm      = azurerm
    azurerm.corp = azurerm.pe
  }
  acl_default_action = "Allow"
  allowed_ips        = []
  default_tags       = var.default_tags
  prod               = true
  sa_rg              = azurerm_resource_group.main.name
  source             = "../shared/modules/Storage-PE"
  storage_main = {
    "name" = "ProdAcmeBot",
    "tier" = "Standard",
    "type" = "ZRS"
  }
}

```

In the module i then data the rg to workout the location on where to put the SA eg

```
data "azurerm_resource_group" "main" {
  name = var.sa_rg
}

resource "azurerm_storage_account" "main" {
  name                              = replace(lower(var.storage_main.name), "/[^a-z0-9]/", "")
  resource_group_name               = data.azurerm_resource_group.main.name
  location                          = data.azurerm_resource_group.main.location 
  account_tier                      = try(var.storage_main.tier, "Standard")
  account_replication_type          = try(var.storage_main.type, "ZRS")
  account_kind                      = "StorageV2"
  enable_https_traffic_only         = try(var.storage_main.enable_https_traffic_only, true)
  min_tls_version                   = "TLS1_2"
  shared_access_key_enabled         = var.shared_access_key_enabled
  is_hns_enabled                    = var.is_hns_enabled
  infrastructure_encryption_enabled = var.infrastructure_encryption_enabled
  access_tier                       = try(var.storage_main.access_tier, var.access_tier)
  #nfsv3_enabled                     = "true"

  blob_properties {
    delete_retention_policy {
      days = var.delete_retention_policy
    }
    versioning_enabled = var.versioning_enabled
    container_delete_retention_policy {
      days = var.container_delete_retention_policy
    }
  }
    network_rules {
    default_action             = var.acl_default_action
    ip_rules                   = var.boot_diags_sa ? setunion(var.Boot_diags_ips, var.allowed_ips) : var.allowed_ips
    virtual_network_subnet_ids = []
    bypass                     = ["Logging", "Metrics", "AzureServices"]
  }
  tags = local.tags
}

```

However the code wants to rebuild all the time. Again statically defining it stops this rebuild. Using anything like a local or data ie a runtime variable forces it to rebuild. vars are fine, as they are filled in via the preprocessor not worked out at runtime

```
  # module.storage.azurerm_storage_account.main must be replaced
-/+ resource "azurerm_storage_account" "main" {
      ~ id                                = "RADACT" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ location                          = "northeurope" -> (known after apply) # forces replacement
        name                              = "RADACT"
```



